<a href="https://colab.research.google.com/github/brendanpshea/database_class/blob/main/Intro_SQL_2_Groups%2C_Subqueries%2C_Sets%2C_and_More!.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#More SQL: Groups, Subqueries, Sets, and More!
##Database and SQL | Course Notes / Brendan Shea, PhD (Brendan.Shea@rctc.edu)
In this lecture, we'll be continuing our introduction to Structured Query Langauge (SQL), this time using a Postgres Database containing Movie Info. Postgres requires a bit more work to set up (and it isn't built into Python, in the way SQLite is). However, it is an enterprise-scale DBMS has capabilites that go beyond those of SQLite.

The main topics we'll be covering in this lecture include:

1. How GROUP BY and HAVING can be used to filter results, and how this differs from WHERE.
2. How subqueries can be used to write "queries within queries."
3. Some of the non-ANSI-standard "functions" that are included with most versions of SQL.

With that in mind, let's get started!

To begin with, we'll need to download our database, load PostgreSQL, and connect to the database. Then, we'll diplay the schemas for our various database table.

Postgres 10 documentation lives here:
https://www.postgresql.org/docs/10/index.html

In [ ]:
# Some UNIX and Pyhton utilites we need to install for the lab.
!pip install wget --quiet
!pip install sqlalchemy --quiet
!pip install ipython-sql --quiet
!pip install pgspecial --quiet

# Install postgresql server
!sudo apt-get -y -qq update
!sudo apt-get -y -qq install postgresql
!sudo service postgresql start

# Setup a password `postgres` for username `postgres`
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

# Setup a postgres database with name `my_data` to be used
!sudo -u postgres psql -U postgres -c 'DROP DATABASE IF EXISTS my_data;'
!sudo -u postgres psql -U postgres -c 'CREATE DATABASE my_data;'

# Postgres variables
%env DB_NAME=my_data
%env DB_HOST=localhost
%env DB_PORT=5432
%env DB_USER=postgres
%env DB_PASS=postgres

# Now let's download the file we'll be using for this lab
!wget -N 'https://raw.githubusercontent.com/brendanpshea/database_class/main/movie_dump.sql' -q

# Load our file and connect to the database
!PGPASSWORD=$DB_PASS psql -q -h $DB_HOST -p $DB_PORT -U $DB_USER -d $DB_NAME -f movie_dump.sql

# Finally, let's make a connnection with the databse
%load_ext sql
%sql postgresql://$DB_USER:$DB_PASS@$DB_HOST/$DB_NAME

 * Starting PostgreSQL 10 database server
   ...done.
ALTER ROLE
DROP DATABASE
CREATE DATABASE
env: DB_NAME=my_data
env: DB_HOST=localhost
env: DB_PORT=5432
env: DB_USER=postgres
env: DB_PASS=postgres

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

'Connected: postgres@my_data'

In [ ]:
# Now let's diplay the table schema
%%sql 
SELECT * FROM pg_catalog.pg_tables WHERE schemaname != 'pg_catalog' AND schemaname != 'information_schema';

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('public', 'actor', 'postgres', None, True, False, True, False),
 ('public', 'director', 'postgres', None, True, False, True, False),
 ('public', 'movie', 'postgres', None, True, False, True, False),
 ('public', 'oscar', 'postgres', None, True, False, True, False),
 ('public', 'person', 'postgres', None, True, False, True, False)]

In [ ]:
%%sql 
\dt

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('public', 'actor', 'table', 'postgres'),
 ('public', 'director', 'table', 'postgres'),
 ('public', 'movie', 'table', 'postgres'),
 ('public', 'oscar', 'table', 'postgres'),
 ('public', 'person', 'table', 'postgres')]

In [ ]:
# Show the first 5 rows of each table
movie_df = %sql SELECT * FROM Movie LIMIT 5;
person_df = %sql SELECT * FROM Person LIMIT 5;
actor_df = %sql SELECT * FROM Actor LIMIT 5;
director_df = %sql SELECT * FROM Director LIMIT 5;
oscar_df = %sql SELECT * FROM Oscar LIMIT 5;
print('\nMovie\n', movie_df,'\nPerson\n',person_df, '\nActor\n', actor_df, 
      '\nDirector\n', director_df, '\nOscar\n', oscar_df)

 * postgresql://postgres:***@localhost/my_data
5 rows affected.
 * postgresql://postgres:***@localhost/my_data
5 rows affected.
 * postgresql://postgres:***@localhost/my_data
5 rows affected.
 * postgresql://postgres:***@localhost/my_data
5 rows affected.
 * postgresql://postgres:***@localhost/my_data
5 rows affected.

Movie
 +---------+------------------------------+------+--------+---------+-------+---------------+
|    id   |             name             | year | rating | runtime | genre | earnings_rank |
+---------+------------------------------+------+--------+---------+-------+---------------+
| 2488496 | Star Wars: The Force Awakens | 2015 | PG-13  |   138   |   A   |       1       |
| 4154796 |      Avengers: Endgame       | 2019 | PG-13  |   181   |  AVS  |       2       |
| 0499549 |            Avatar            | 2009 | PG-13  |   162   |  AVYS |       3       |
| 1825683 |        Black Panther         | 2018 | PG-13  |   134   |  AVS  |       4       |
| 4154756 |    Avengers: Infinity War    | 2018 | PG-13  |   149   |  AVYS |       5       |
+---------+------------------------------+------+--------+---------+-------+---------------+
Person
 +---------+----------------+---------------------+------------+
|    id   |      name      |         pob         |    dob     |
+---------+----------------+---------------------+------------+
| 0001105 | Linda Darnell  |  Dallas, Texas, USA | 1923-10-16 |
| 0005253 | Elisabeth Moss |         None        | 1983-01-01 |
| 0154530 | Andrew Chavez  |         None        |    None    |
| 0240381 |  Hilary Duff   | Houston, Texas, USA | 1987-09-28 |
| 0679406 | Chuck Pfeiffer |         None        |    None    |
+---------+----------------+---------------------+------------+
Actor
 +----------+----------+
| actor_id | movie_id |
+----------+----------+
| 0000138  | 0120338  |
| 0000701  | 0120338  |
| 0000708  | 0120338  |
| 0000870  | 0120338  |
| 0000200  | 0120338  |
+----------+----------+
Director
 +-------------+----------+
| director_id | movie_id |
+-------------+----------+
|   0000116   | 0120338  |
|   0000184   | 0076759  |
|   0011470   | 0298148  |
|   0000229   | 0083866  |
|   0000184   | 0120915  |
+-------------+----------+
Oscar
 +----------+-----------+-------------------------+------+
| movie_id | person_id |           type          | year |
+----------+-----------+-------------------------+------+
| 6751668  |    None   |       BEST-PICTURE      | 2020 |
| 7286456  |  0001618  |        BEST-ACTOR       | 2020 |
| 7549996  |  0000250  |       BEST-ACTRESS      | 2020 |
| 7131622  |  0000093  |  BEST-SUPPORTING-ACTOR  | 2020 |
| 7653254  |  0000368  | BEST-SUPPORTING-ACTRESS | 2020 |
+----------+-----------+-------------------------+------+

#1. GROUPY BY and Group-level statistics
In the last lesson, we'll talked about the use of aggregate functions such as COUNT, MAX, MIN, AVG, and SUM. So far, though, we've only been applying these to the whole of our query results (that is, we end up counting ALL of the rows that our query returns). In many real-world situations, though, we actually want to apply these to statistics to different GROUPS of data. That's where GROUP BY comes. 



```
SELECT columns FROM tables
[WHERE conditions]
[GROUP BY columns]
[ORDERED BY columns]
```

We'll look at a few examples.

In [ ]:
# Let's list average run time of movies broken down by movie rating
%%sql
SELECT rating, AVG(runtime) FROM Movie
  GROUP BY rating;

 * postgresql://postgres:***@localhost/my_data
8 rows affected.

[('PG', Decimal('112.1888111888111888')),
 (None, Decimal('115.6350364963503650')),
 ('PG-13', Decimal('127.4529914529914530')),
 ('R', Decimal('126.5240963855421687')),
 ('M', Decimal('124.0000000000000000')),
 ('G', Decimal('116.4102564102564103')),
 ('GP', Decimal('187.0000000000000000')),
 ('NC-17', Decimal('114.5000000000000000'))]

In [ ]:
# Or we could get both a COUNT and an AVERAGE runtime
%%sql
SELECT rating, COUNT(rating), AVG(runtime) FROM Movie
  GROUP BY rating;

 * postgresql://postgres:***@localhost/my_data
8 rows affected.

[('PG', 143, Decimal('112.1888111888111888')),
 (None, 0, Decimal('115.6350364963503650')),
 ('PG-13', 234, Decimal('127.4529914529914530')),
 ('R', 166, Decimal('126.5240963855421687')),
 ('M', 5, Decimal('124.0000000000000000')),
 ('G', 39, Decimal('116.4102564102564103')),
 ('GP', 1, Decimal('187.0000000000000000')),
 ('NC-17', 2, Decimal('114.5000000000000000'))]

In [ ]:
# Now for a trickier one
# Let's find the list of the five most prolific actors

%%sql 
SELECT P.name, COUNT(A.actor_id) as "# of Movies" FROM Actor A 
  JOIN Person P ON P.id = A.actor_id
  GROUP BY A.actor_id, P.name
  ORDER BY COUNT(A.actor_id) DESC
  LIMIT 5;

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('Tom Cruise', 15),
 ('Tom Hanks', 12),
 ('Will Smith', 12),
 ('Robert Downey Jr.', 11),
 ('Harrison Ford', 11)]

#2. Putting limitation on groups with HAVING
Along with producing group-level statistics, we often want to restrict our query results to include only certain groups. So, for example, we might want to know "Which actors have appeared in at least 10 movies?" This requires both a GROUP BY (to collect our data about a particular data) and then excluding those "groups" (i.e., actors) that have appeared in less than 10 movies. 

This is where HAVING, which allows us to restrict the results of GROUP BY comes in:


```
SELECT columns FROM tables
[WHERE conditions]
[GROUP BY columns]
[HAVING conditions]
[ORDERED BY columns]
```

In [ ]:
# Let's find the actors that have appered in at least 10 movies.
%%sql 
SELECT P.name, COUNT(A.actor_id) as "# of Movies" FROM Actor A 
  JOIN Person P ON P.id = A.actor_id
  GROUP BY P.name
  HAVING COUNT(A.actor_id) >= 10
  ORDER BY COUNT(A.actor_id) DESC

 * postgresql://postgres:***@localhost/my_data
7 rows affected.

[('Tom Cruise', 15),
 ('Will Smith', 12),
 ('Tom Hanks', 12),
 ('Robert Downey Jr.', 11),
 ('Harrison Ford', 11),
 ('Scarlett Johansson', 10),
 ('Robert De Niro', 10)]

In [ ]:
# Or, let's find the list of movies that
# have won exactly 4 Oscars
# Note: Only certain types of Oscars are in our database!
%%sql 
SELECT M.name, M.year, COUNT(O.type) FROM Movie M
  JOIN Oscar O ON M.id = O.movie_id
  GROUP BY M.name, M.year
  HAVING COUNT(O.type) = 4;

 * postgresql://postgres:***@localhost/my_data
14 rows affected.

[('From Here to Eternity', 1953, 4),
 ('Terms of Endearment', 1983, 4),
 ('Ben-Hur', 1959, 4),
 ('Million Dollar Baby', 2004, 4),
 ('It Happened One Night', 1934, 4),
 ('West Side Story', 1961, 4),
 ("One Flew Over the Cuckoo's Nest", 1975, 4),
 ('Going My Way', 1944, 4),
 ('On the Waterfront', 1954, 4),
 ('Gone with the Wind', 1939, 4),
 ('Kramer vs. Kramer', 1979, 4),
 ('Best Years of Our Lives, The', 1946, 4),
 ('Mrs. Miniver', 1942, 4),
 ('Silence of the Lambs, The', 1991, 4)]

#3. Simple Subqueries using WHERE and IN
Sub-queries allow us to write "queries within queries." They are used when we need to do multiple things to our examples. 

So, for a common example, we want to find the MAXIMUM value for some column (our "inner query"), and then we want to find some information about the entity (or entities) that actually has that MAX. This query has the form:


```
SELECT c1, c2, c3, ..FROM tables
WHERE c1 IN:
  (SELECT MAX(c1) FROM tables);
```

There are many, many types of subqueries and it is almost always *possible* to use subqueries. However, as a rule of thumb, one should only use subqueries if one genuinely needs them. They can be slow to run and difficult for other to maintain/understand.

In [ ]:
# Example: Let's find the movie (or movies) with the longest run time

%%sql 
SELECT name, runtime FROM Movie
  WHERE runtime IN 
    (SELECT MAX(runtime) FROM Movie)

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[('Gone with the Wind', 238)]

In [ ]:
# Or, we could just find the list of movies
# that have a run time of 150% or more of the average
%%sql 
SELECT name, runtime FROM Movie
  WHERE runtime > 1.5 * 
    (SELECT AVG(runtime) FROM Movie)

 * postgresql://postgres:***@localhost/my_data
19 rows affected.

[('Titanic', 194),
 ('Avengers: Age of Ultron', 195),
 ('Lord of the Rings: The Return of the King, The', 201),
 ('Batman v Superman: Dawn of Justice', 183),
 ('King Kong', 187),
 ('Gone with the Wind', 238),
 ('Pearl Harbor', 183),
 ('Green Mile, The', 188),
 ("Schindler's List", 197),
 ('Gandhi', 188),
 ('Reds', 194),
 ('Deer Hunter, The', 183),
 ('Godfather: Part II, The', 200),
 ("Ryan's Daughter", 187),
 ('Lawrence of Arabia', 216),
 ('Spartacus', 184),
 ('Ben-Hur', 212),
 ('Around the World in Eighty Days', 188),
 ('Giant', 201)]

#4. Subqueries in the HAVING clause
We can also subqueries in the HAVING clause, where we filter groups by the result of some other query. So, for example, we could find the number of movies acted in by actors *who appeared in a Star Wars film." This involves:

1. Inner Query -- Getting a full list of the actors (or really, the actor ids) of people who've appeared in films whose title  starts with "Star Wars."
2. Outer Query -- Producing a count of how many films total (not just Star Wars films) each of these people has appeared in.

These sorts of queries can appear really messy! My advice is to write and test the inner query (where you find the list of actor_ids of people who appeared in Star Wars films) first, and only then put it together with the outer query.

In [ ]:
%%sql 
SELECT P.name, COUNT(A.actor_id) as "# of Movies" FROM Actor A 
  JOIN Person P ON P.id = A.actor_id
  GROUP BY A.actor_id, P.name
  HAVING A.actor_id IN 
    (SELECT A1.actor_id FROM Movie M1 
      JOIN Actor A1 ON A1.movie_id=M1.id
      WHERE M1.name LIKE 'Star Wars%');

 * postgresql://postgres:***@localhost/my_data
19 rows affected.

[('Natalie Portman', 6),
 ('John Boyega', 2),
 ('Christopher Lee', 1),
 ('Billy Dee Williams', 2),
 ('Jake Lloyd', 1),
 ('Adam Driver', 4),
 ('Alec Guinness', 4),
 ('Hayden Christensen', 2),
 ('Ian McDiarmid', 1),
 ('Samuel L. Jackson', 7),
 ('Anthony Daniels', 2),
 ('Pernilla August', 1),
 ('Liam Neeson', 5),
 ('Harrison Ford', 11),
 ('Daisy Ridley', 3),
 ('Mark Hamill', 6),
 ('Peter Cushing', 1),
 ('Carrie Fisher', 7),
 ('Ewan McGregor', 4)]

#5. Subqueries Using ALL or ANY
Sometimes we want to check whether our results are bigger (or smaller) than any of the values produced by a different query (i.e., the subquery). This is, in many mays, similar to the use of MAX (for ALL) or MIN (for ANY). However, ANY and ALL provide a much more straightforward way of doing such comparisons.

So, for example, let's say I'd like to answer questions such as the following 

*  "Which movies have a higher earnings rank than *all* of the Spider-Man movies?"
*  "How many movies have an earning rank lower than ANY of the Spider-Man movies in the database?"

In [ ]:
# Which movies have a higher earnings rank than *all* of the Spider-Man movies?
%%sql
SELECT name, earnings_rank FROM Movie
  WHERE earnings_rank < 
    ALL(SELECT earnings_rank FROM Movie WHERE name LIKE 'Spider-Man');

 * postgresql://postgres:***@localhost/my_data
34 rows affected.

[('Star Wars: The Force Awakens', 1),
 ('Avengers: Endgame', 2),
 ('Avatar', 3),
 ('Black Panther', 4),
 ('Avengers: Infinity War', 5),
 ('Titanic', 6),
 ('Jurassic World', 7),
 ('The Avengers', 8),
 ('Star Wars: Episode VIII - The Last Jedi', 9),
 ('Incredibles 2', 10),
 ('The Lion King', 11),
 ('The Dark Knight', 12),
 ('Rogue One: A Star Wars Story', 13),
 ('Star Wars: The Rise Of Skywalker', 14),
 ('Beauty and the Beast', 15),
 ('Finding Dory', 16),
 ('Frozen II', 17),
 ('Star Wars: Episode I - The Phantom Menace', 18),
 ('Star Wars: Episode IV - A New Hope', 19),
 ('Avengers: Age of Ultron', 20),
 ('The Dark Knight Rises', 21),
 ('Shrek 2', 22),
 ('E.T. the Extra-Terrestrial', 23),
 ('Toy Story 4', 24),
 ('Captain Marvel', 25),
 ('The Hunger Games: Catching Fire', 26),
 ("Pirates of the Caribbean: Dead Man's Chest", 27),
 ('Lion King, The', 28),
 ('Jurassic World: Fallen Kingdom', 29),
 ('Toy Story 3', 30),
 ('Wonder Woman', 31),
 ('Iron Man 3', 32),
 ('Captain America: Civil War', 33),
 ('The Hunger Games', 34)]

In [ ]:
# "How many movies have an earning rank lower than ANY of the Spider-Man movies in the database?"
%%sql
SELECT COUNT(*) FROM Movie
  WHERE earnings_rank < 
    ANY(SELECT earnings_rank FROM Movie WHERE name LIKE 'Spider-Man');

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[(34,)]

# 6. Subqueries in the SELECT Clause
Sometimes (rarely!), you'll want to include a subquery in the SELECT clause. This query will need toi re-run FOR EACH AND EVERY row of your results (which means this is O(n^2) at best--really slow for those of you haven't taken algorithms). These are the kinds of queries that can be fun to write (and for CS professors to assing on homeowork), but that can give DBMS administrators.

However, to give you an example, we're going to run a query that answers the question "Can you give me a list of movies, the year they were released, their earnings rank, *and the average earnings rank for all movies released in the same year?"

You'll notice a few things about this query:
1. We're going to need to (in effect) JOIN the Movie table with itself, since we want to repeatedy do searches for "Movies that came out in the same year as some other movie."
2. We're going to use a subquery to calculate a new average for every row (that is, every movie) in our database.
3. We're going to ROUND our result to 2 decimals.

Again, this is (in general) a bad way to write queries, since we are repeatedly calculating values (the average earnings rank of a movie released in a certain year) that ideally should only be calculated once. This isn't a big deal for 1,000 rows, given the speed of modern computers. It could be a HUGE deal for 1,000,000 rows, though, no matter how fast your computer is.

In [ ]:
%%sql

SELECT name, earnings_rank, year, 
  (SELECT ROUND(AVG(earnings_rank), 2) 
    FROM Movie M2 WHERE M2.year = M.year)
    AS "Earning Rank Avg for Year"
  FROM Movie M
  LIMIT 10;

 * postgresql://postgres:***@localhost/my_data
10 rows affected.

[('Star Wars: The Force Awakens', 1, 2015, Decimal('56.89')),
 ('Avengers: Endgame', 2, 2019, Decimal('46.64')),
 ('Avatar', 3, 2009, Decimal('103.40')),
 ('Black Panther', 4, 2018, Decimal('106.69')),
 ('Avengers: Infinity War', 5, 2018, Decimal('106.69')),
 ('Titanic', 6, 1997, Decimal('97.00')),
 ('Jurassic World', 7, 2015, Decimal('56.89')),
 ('The Avengers', 8, 2012, Decimal('103.36')),
 ('Star Wars: Episode VIII - The Last Jedi', 9, 2017, Decimal('87.23')),
 ('Incredibles 2', 10, 2018, Decimal('106.69'))]

#7. Working with Dates
SQL also allows to work with dates in various ways. For examples, we can do things like:
1. Get the current date
2. Calculate the difference betweeen two dates
3. Extract month, day, or year
4. Many other things

The treatment of dates (unlike most of what we've talked about so far) is NOT specified by the SQL ANSI standard. So, different database software (MySQL, Postgres, Oracles, etc.) will handle them differently. You'll need to read the documentation, or check StackOverflow :).

In [ ]:
#First, let's set our timezone
# https://www.postgresql.org/docs/7.2/timezones.html
%%sql
SET TIMEZONE='America/Chicago';

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [ ]:
# Let's get the current time!
%%sql
SELECT NOW();

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[(datetime.datetime(2022, 3, 18, 10, 0, 17, 188988, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-300, name=None)),)]

In [ ]:
# We can also do things like extract the year, month or day from dates
# Using MONTH(), YEAR(), and DAY()
# Here ":: Date" means "treat this string as a date"

%%sql
SELECT EXTRACT(Year FROM '1979-05-21' :: Date) as "Year",
  EXTRACT(Month FROM '1979-05-21' :: Date) as "Month",
  EXTRACT(Day FROM '1979-05-21' :: Date) as "Day"

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[(1979.0, 5.0, 21.0)]

In [ ]:
# How long ago was Will Smith born? Let's find out!
%%sql 
SELECT name, dob, NOW()-dob AS "Age (days)"
  FROM Person
  WHERE name = 'Will Smith';

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[('Will Smith', datetime.date(1968, 9, 25), datetime.timedelta(days=19532, seconds=37767, microseconds=803274))]

In [ ]:
# We can do the same thing with AGE()
%%sql
SELECT name, dob, AGE(dob) AS "Age (days)"
  FROM Person
  WHERE name = 'Will Smith';

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[('Will Smith', datetime.date(1968, 9, 25), datetime.timedelta(days=19518))]

In [ ]:
# What's earliest date of birth recorded in our database?
# We can use MIN() to find out
%%sql 
SELECT name, dob FROM Person
  WHERE dob = 
    (SELECT MIN(dob) FROM Person)

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[('Albert Gran', datetime.date(1862, 8, 4))]

In [ ]:
# In order to find the age in years, we could do the following:
%%sql 
SELECT name, dob, 
  EXTRACT(YEAR FROM AGE(dob)) as "Born this many years ago"
  FROM Person
  WHERE dob = 
    (SELECT MIN(dob) FROM Person)

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[('Albert Gran', datetime.date(1862, 8, 4), 159.0)]

#8. Relational Algebra
SQL also supports all of the relational algebra operators such as UNION, INTERSECT, difference (EXCEPT) etc.

In [ ]:
# Let's find the list of people who have (1) acted in at least 2 movies
# and (2) directed at least 2 movies
%%sql
SELECT name FROM Person
  JOIN Actor on Person.id = Actor.actor_id
  GROUP BY name
  HAVING COUNT(name) >= 2
  
INTERSECT

SELECT name from Person
    JOIN Director on Person.id = Director.director_id
    GROUP BY name
    HAVING COUNT(name) >= 2

 * postgresql://postgres:***@localhost/my_data
3 rows affected.

[('Mel Gibson',), ('Clint Eastwood',), ('Jon Favreau',)]

In [ ]:
# How about the list of people who have EIthER acted in 10 movies
# OR directed 10 movies?

%%sql
SELECT name FROM Person
  JOIN Actor on Person.id = Actor.actor_id
  GROUP BY name
  HAVING COUNT(name) >= 10
  
UNION

SELECT name from Person
    JOIN Director on Person.id = Director.director_id
    GROUP BY name
    HAVING COUNT(name) >= 10

 * postgresql://postgres:***@localhost/my_data
8 rows affected.

[('Harrison Ford',),
 ('Steven Spielberg',),
 ('Will Smith',),
 ('Robert De Niro',),
 ('Scarlett Johansson',),
 ('Tom Hanks',),
 ('Tom Cruise',),
 ('Robert Downey Jr.',)]

In [ ]:
# Or we could find the names of actors named Steven who haven't directed
# Using EXCEPT
%%sql
SELECT name FROM Person
  JOIN Actor on Person.id = Actor.actor_id
  WHERE name LIKE 'Steven%'

EXCEPT

SELECT name FROM Person
  JOIN Director on Person.id = Director.director_id
  WHERE name LIKE 'Steven%'

 * postgresql://postgres:***@localhost/my_data
3 rows affected.

[('Steven Chester Prince',), ('Steven Berkoff',), ('Steven Weber',)]

#9. Working with Numbers and "Derived Tables"
SQL also has the ability to work with numbers in various ways. As with dates, many of these functions go "beyond" ANSI standard SQL, and so you'll need to double-check the documentation for the details on how your particular "flavor" of SQL handles it.

https://www.postgresql.org/docs/10/functions-math.html

I've just provided a few examples here. We are going to:
1. Take an absolute value.
2. Generate a series of random numbers.
3. Give an example of a "derived table."

In [ ]:
# Absolute value 
%%sql
SELECT ABS(-10.4356)

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[(Decimal('10.4356'),)]

In [ ]:
# Get a random int between 1 and 1000
%%sql
SELECT ROUND(RANDOM() * 1000)

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[(142.0,)]

In [104]:
# We can also get 5 random numbers
# using the GENERATE_SERIES function
%%sql
SELECT ROUND(RANDOM() * 1000) FROM GENERATE_SERIES(1,5)

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[(419.0,), (711.0,), (468.0,), (136.0,), (199.0,)]

In [109]:
# OK, let's now generate a random number between 1 and 1000
# and do some math with them
# We'll need to use a "derived table" as shown here, since
# this allows us to "save" the random numbers we want to work with
%%sql 
SELECT my_number, SQRT(my_number), LN(my_number), POW(my_number, 2) FROM
  (SELECT ROUND(RANDOM() * 1000) as my_number -- This is a column alias
  FROM GENERATE_SERIES(1,10)) AS my_table -- the "AS" here gives us the derived table

 * postgresql://postgres:***@localhost/my_data
10 rows affected.

[(894.0, 29.8998327754521, 6.79570577517351, 799236.0),
 (993.0, 31.5119025131775, 6.90073066404517, 986049.0),
 (312.0, 17.6635217326557, 5.74300318780948, 97344.0),
 (453.0, 21.2837966537928, 6.11589212548303, 205209.0),
 (669.0, 25.8650343127551, 6.50578406012823, 447561.0),
 (542.0, 23.2808934536456, 6.29526600143965, 293764.0),
 (271.0, 16.4620776331543, 5.6021188208797, 73441.0),
 (821.0, 28.6530975637888, 6.71052310945243, 674041.0),
 (836.0, 28.9136645896019, 6.7286286130847, 698896.0),
 (95.0, 9.74679434480896, 4.55387689160054, 9025.0)]

#10. Processing Strings
Finally, we can process Strings in various ways. There are a *lot* of different functions for doing this, and the exact syntax for these commands will again vary by the type of SQL you are using. 

https://www.postgresql.org/docs/10/functions-string.html

We're going to:
1. Explore how to make strings uppercase and lowercase
2. Compare the lenghths of various strings
3. Spit and conconcatenate Strings

In [113]:
# We can make strings upper case or lowercase
# We can even get their length
%%sql
SELECT name, UPPER(name), LOWER(name), LENGTH(name) FROM Person LIMIT 5;

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('Linda Darnell', 'LINDA DARNELL', 'linda darnell', 13),
 ('Elisabeth Moss', 'ELISABETH MOSS', 'elisabeth moss', 14),
 ('Andrew Chavez', 'ANDREW CHAVEZ', 'andrew chavez', 13),
 ('Hilary Duff', 'HILARY DUFF', 'hilary duff', 11),
 ('Chuck Pfeiffer', 'CHUCK PFEIFFER', 'chuck pfeiffer', 14)]

In [116]:
# Hmmm. I wonder the longest movie name in our database is?
# We need a subquery!
%%sql
SELECT name FROM Movie
  WHERE LENGTH(name) = 
    (SELECT MAX(LENGTH(name)) FROM Movie);

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[('The Chronicles of Narnia: The Lion, the Witch and the Wardrobe',)]

In [133]:
# We can concatenate (or "combine") strings 
%%sql

SELECT 'abc' || '123'

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[('abc123',)]

In [142]:
# Let's put this to work
# Let's "Oscar Winnder" to the names of people who've won
# best actor or actress award since 2012

%%sql 
SELECT 'Oscar Winner ' || P.name
  FROM Person P
  JOIN Oscar O ON O.person_id = P.id
  WHERE (O.type = 'BEST-ACTRESS' OR
  O.type = 'BEST-ACTOR') AND
  O.year > 2012

 * postgresql://postgres:***@localhost/my_data
16 rows affected.

[('Oscar Winner Joaquin Phoenix',),
 ('Oscar Winner Renee Zellweger',),
 ('Oscar Winner Rami Malek',),
 ('Oscar Winner Olivia Colman',),
 ('Oscar Winner Gary Oldman',),
 ('Oscar Winner Frances McDormand',),
 ('Oscar Winner Casey Affleck',),
 ('Oscar Winner Emma Stone',),
 ('Oscar Winner Leonardo DiCaprio',),
 ('Oscar Winner Brie Larson',),
 ('Oscar Winner Eddie Redmayne',),
 ('Oscar Winner Julianne Moore',),
 ('Oscar Winner Matthew McConaughey',),
 ('Oscar Winner Cate Blanchett',),
 ('Oscar Winner Daniel Day-Lewis',),
 ('Oscar Winner Jennifer Lawrence',)]

In [143]:
# We can play with substrings used "regex" expressions
# https://en.wikibooks.org/wiki/Regular_Expressions/POSIX_Basic_Regular_Expressions
# The details here here beyond the scope of the class, but these are quite powerful :).
# Let's get the first three letters and last two letters of people's names
%%sql 
SELECT name, 
  substring(name from '^...'), --first three letters
  substring(name FROM '..$'), -- last two letters
  substring(name from '^[A-Za-z0-9]*'), -- Gets the first name
  substring(name FROM '[A-Za-z0-9]*$') --Get the last name
  FROM Person
LIMIT 10;

 * postgresql://postgres:***@localhost/my_data
10 rows affected.

[('Linda Darnell', 'Lin', 'll', 'Linda', 'Darnell'),
 ('Elisabeth Moss', 'Eli', 'ss', 'Elisabeth', 'Moss'),
 ('Andrew Chavez', 'And', 'ez', 'Andrew', 'Chavez'),
 ('Hilary Duff', 'Hil', 'ff', 'Hilary', 'Duff'),
 ('Chuck Pfeiffer', 'Chu', 'er', 'Chuck', 'Pfeiffer'),
 ('Peter Segal', 'Pet', 'al', 'Peter', 'Segal'),
 ('Charlie Tahan', 'Cha', 'an', 'Charlie', 'Tahan'),
 ('Danielle Skraastad', 'Dan', 'ad', 'Danielle', 'Skraastad'),
 ('Pierre Coffin', 'Pie', 'in', 'Pierre', 'Coffin'),
 ('Marc Webb', 'Mar', 'bb', 'Marc', 'Webb')]